src/Documents/БрокерскиеУслуги/БрокерскиеУслуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>БрокерскиеУслуги</name>
  <basedOn>Document.Контроль</basedOn>
  <attributes>
    <name>Контроль</name>
    <type>
      <types>DocumentRef.Контроль</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоТранспорта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>8</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПоДокументу</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПоДокументуДоллар</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Транспорт</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоТранспорта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВБДоллар</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВКДВДоллар</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВыпускДоллар</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаГрузчикиДоллар</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДопРасходы</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДопРасходыДоллар</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДопРасходыКлиента</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДопРасходыКлиентаДоллар</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаИнСобДоллар</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаИтого</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаИтогоДоллар</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНачДоллар</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОБКДоллар</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПатонДоллар</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПрограммаДоллар</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРегДоллар</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСБУДоллар</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСтоянка</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСЭСДоллар</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаТарифДоллар</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЦеноваяСправка</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЦеноваяСправкаДоллар</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Транспорт</name>
      <type>
        <types>DefinedType.Транспорт</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/СводныеДанные/СводныеДанные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СводныеДанные</name>
  <basedOn>Document.Заявка</basedOn>
  <registerRecords>AccumulationRegister.ДоходыРасходы</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.Заявка</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>DefinedType.КоличествоГруза</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоТранспорта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>8</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетодРаспределения</name>
    <type>
      <types>EnumRef.МетодРаспределения</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерГТД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентНалоговыйКредит</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>РассчитыватьПоКурсу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОплаты</name>
    <type>
      <types>EnumRef.СтатусыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБрокерскиеУслуги</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБрокерскиеУслугиДоллар</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаГТД</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДоход</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДоходДоллар</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаИнвойса</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаИтогДоллар</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПлатежа</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПлатежаДоллар</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПоДокументу</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПоДокументуДоллар</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПроценты</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРасходы</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРасходыДоллар</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРезультат</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЭкспедиторскиеУслуги</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЭкспедиторскиеУслугиДоллар</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКонтрагента</name>
    <type>
      <types>EnumRef.ТипКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортСтрокой</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Транспорт</name>
    <attributes>
      <name>ДатаГТД</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.Заявка</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоГруза</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Порт</name>
      <type>
        <types>CatalogRef.Порты</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБрокерскиеУслуги</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБрокерскиеУслугиДоллар</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДоход</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДоходДоллар</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаИтог</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаИтогДоллар</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежаДоллар</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПроценты</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПроцентыДоллар</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРезультат</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСтрока020</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСтрока028</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЭкспедиторскиеУслуги</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЭкспедиторскиеУслугиДоллар</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипКонтрагента</name>
      <type>
        <types>EnumRef.ТипКонтрагента</types>
      </type>
    </attributes>
    <attributes>
      <name>Транспорт</name>
      <type>
        <types>DefinedType.Транспорт</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаДоллар</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/БрокерскиеУслуги/Forms/Документ/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере ( Отказ, СтандартнаяОбработка )
	
	Если ( Объект.Ссылка.Пустая () ) Тогда
		начальноеЗаполнение ();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура начальноеЗаполнение ()
	
	Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Объект.Валюта = Справочники.Валюты.Доллар; 
	Объект.Курс = получитьКурс ( ? ( Объект.Ссылка.Пустая (), ТекущаяДата (), Объект.Дата ), Объект.Валюта );
	Если (  ЗначениеЗаполнено ( Параметры.Основание ) ) Тогда
		// код ...
	Иначе
		Объект.Организация = Константы.ОсновнаяОрганизация.Получить ();			
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция получитьКурс ( Дата, Валюта )
	
	курсы = ОбщийДокументы.ПолучитьКурс ( Дата, Валюта );
	Возврат курсы.Курс;

КонецФункции

&НаКлиенте
Процедура ЗаполнитьПоГТД ( Команда )
	
	Если ( ЗначениеЗаполнено ( Объект.ГТД ) ) Тогда
		Если ( Объект.Транспорт.Количество () > 0 ) Тогда
			ПоказатьВопрос ( Новый ОписаниеОповещения ( "ВопросЗаполнитьПоГТД", ЭтотОбъект ), "Очистить и заполнить табличную часть ""Транспорт""?", РежимДиалогаВопрос.ДаНетОтмена );
		Иначе
			заполнитьПоГТДСервер ();
		КонецЕсли;
	Иначе
		Сообщить ( "Не выбран документ ""ГТД""!", СтатусСообщения.Важное );
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросЗаполнитьПоГТД ( Ответ, Парам ) Экспорт
	
	Если ( Ответ = КодВозвратаДиалога.Отмена ) Тогда
		Возврат;
	ИначеЕсли ( Ответ = КодВозвратаДиалога.Да ) Тогда
		Объект.Транспорт.Очистить (); 
	КонецЕсли;
	заполнитьПоГТДСервер ();
	
КонецПроцедуры 

&НаСервере
Процедура заполнитьПоГТДСервер ()
	
	с = "
	|выбрать
	|	Контрагент как Контрагент, Номенклатура как Номенклатура, Транспорт как Транспорт
	|из
	|	Документ.СводныеДанные.Транспорт
	|где
	|	Ссылка = &СводныеДанные
	|упорядочить по
	|	НомерСтроки 
	|";
	запрос = Новый Запрос ( с );
	запрос.УстановитьПараметр ( "СводныеДанные", Объект.ГТД );
	результат = запрос.Выполнить ();
	выборка = результат.Выбрать ();
	Пока ( выборка.Следующий () ) Цикл
		новаяСтрока = Объект.Транспорт.Добавить ();
		ЗаполнитьЗначенияСвойств ( новаяСтрока, выборка ); 
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортСуммаПриИзменении ( Элемент )
	
	рассчитатьИтоги ( Элементы.Транспорт.ТекущиеДанные );	
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортСуммаРасчетнаяПриИзменении ( Элемент )
	
	рассчитатьСвязанноеПоле ( Элемент.Имя );
	
КонецПроцедуры

&НаКлиенте
Процедура рассчитатьИтоги ( Данные )
	
	Данные.СуммаИтого = Данные.СуммаДопРасходы + Данные.СуммаСтоянка + Данные.СуммаЦеноваяСправка;						
	Данные.СуммаИтогоДоллар = Данные.СуммаВБДоллар + Данные.СуммаВКДВДоллар + Данные.СуммаВыпускДоллар
						+ Данные.СуммаГрузчикиДоллар + Данные.СуммаДопРасходыДоллар + Данные.СуммаИнСобДоллар
						+ Данные.СуммаНачДоллар + Данные.СуммаОБКДоллар + Данные.СуммаПатонДоллар
						+ Данные.СуммаПрограммаДоллар + Данные.СуммаРегДоллар + Данные.СуммаСБУДоллар
						+ Данные.СуммаТарифДоллар + Данные.СуммаЦеноваяСправкаДоллар + Данные.СуммаСЭСДоллар;
	Объект.СуммаПоДокументу = 0;
	Объект.СуммаПоДокументуДоллар = 0;
	Для Каждого строкаТЧ Из Объект.Транспорт Цикл
		Объект.СуммаПоДокументу = Объект.СуммаПоДокументу + строкаТЧ.СуммаИтого;
		Объект.СуммаПоДокументуДоллар = Объект.СуммаПоДокументуДоллар + строкаТЧ.СуммаИтогоДоллар;  
	КонецЦикла; 
	
КонецПроцедуры 

&НаКлиенте
Процедура рассчитатьСвязанноеПоле ( Знач ИмяЭлемента )
	
	текущиеДанные = Элементы.Транспорт.ТекущиеДанные;
	//ИмяЭлемента = СтрЗаменить ( ИмяЭлемента, "Транспорт", "" );
	//Если ( СтрНайти ( ИмяЭлемента, "Доллар" ) ) = 0 Тогда
	//	// гривна
	//	имяРасчетногоПоля = ИмяЭлемента + "Доллар";
	//	Если ( Объект.Курс = 0 ) Тогда
	//		текущиеДанные [ имяРасчетногоПоля ] = 0;  
	//	Иначе
	//		текущиеДанные [ имяРасчетногоПоля ] = текущиеДанные [ ИмяЭлемента ] / Объект.Курс;
	//	КонецЕсли; 
	//Иначе
	//	// доллар
	//	имяРасчетногоПоля = СтрЗаменить ( ИмяЭлемента, "Доллар", "" );
	//	текущиеДанные [ имяРасчетногоПоля ] = текущиеДанные [ ИмяЭлемента ] * Объект.Курс;
	//КонецЕсли;
	рассчитатьИтоги ( текущиеДанные );
	
КонецПроцедуры

&НаКлиенте
Процедура ГТДПриИзменении ( Элемент )
	
	Если ( ЗначениеЗаполнено ( Объект.Контроль ) ) Тогда
		ПоказатьВопрос ( Новый ОписаниеОповещения ( "ВопросОЗаполнении", ЭтотОбъект ), "Заполнить на основании документа ""Контроль""?", РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Нет );
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросОЗаполнении ( Ответ, Парам ) Экспорт
	
	Если ( Ответ = КодВозвратаДиалога.Да ) Тогда
		заполнитьНаСервере ();
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура заполнитьНаСервере ()
	
	_объект = РеквизитФормыВЗначение ( "Объект" );
	_объект.ОбработкаЗаполнения ( Объект.Контроль, Истина );
	ЗначениеВРеквизитФормы ( _объект, "Объект" );
	
КонецПроцедуры

&НаКлиенте
Процедура ТранспортСуммаСЭСДолларПриИзменении ( Элемент )
	
	рассчитатьИтоги ( Элементы.Транспорт.ТекущиеДанные );	
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении ( Элемент )
	
	Объект.Курс = получитьКурс ( ? ( Объект.Ссылка.Пустая (), ТекущаяДата (), Объект.Дата ), Объект.Валюта );
	
КонецПроцедуры
